[
  "I saw an ad for burial plots, but that’s the last thing I need.",
  "Did you hear about the silk worm race? It ended in a tie.",
  "I got fired from the calendar factory, just for taking a day off.",
  "Q: What’s the best thing about Switzerland? A: Well, the flag is a big plus.",
  "Clones are people two.",
  "I wanted to learn how to drive a stick shift, but I couldn’t find a manual.",
  "Napoleon may not have designed his coat, but he did have a hand in it.",
  "I put up a high-voltage electric fence around my house. My neighbor is dead against it.",
  "What are windmills’ favorite genre of music? They’re big metal fans.",
  "The past, present, and future walk into a bar. It was tense.",
  "Shopping centers, you’ve seen one, you’ve seen the mall.",
  "My ceiling isn’t the best, but it’s up there.",
  "I love whiteboards. They’re re-markable.",
  "Which country’s capital has the fastest-growing population? AIreland. Every day it’s Dublin.",
  "The machine at the coin factory just suddenly stopped working. It doesn’t make any cents.",
  "I tried to make a belt out of watches. It was a waist of time.",
  "I went to a new mechanic. They came highly wreck-a-mended.",
  "What’s the difference between a hippo and a Zippo? A hippo is really heavy, and a Zippo is a little lighter.",
  "Yesterday a clown held the door open for me. It was such a nice jester.",
  "Why can’t you run through a campground? You can only ran, because it’s past tents.",
  "Becoming a vegetarian is a big missed steak.",
  "Why can’t Harry Potter tell the difference between his potion pot and his best friend? They’re both cauld ron.",
  "An atom lost an electron. It really should keep an ion them.",
  "What’s the best time on a clock? 6:30, hands down.",
  "Please don’t make my funeral too early. I’m not really a mourning person.",
  "I got fired from the bank. A man asked me to check his balance, so I pushed him over.",
  "Why did the lizard say he named his baby “Tiny?” Because he’s my newt.",
  "Someone stole the police station’s toilets. They have nothing to go on.",
  "Having sex in an elevator is wrong on so many levels.",
  "What’s the difference between a poorly dressed man on a bicycle and a nicely dressed man on a tricycle? Attire.",
  "What does C.S. Lewis keep in his wardrobe? Narnia business.",
  "I put all my cash into an origami business. It folded.",
  "I was worried about being in a long-distance relationship. But so far so good.",
  "I suffer from kleptomania. But I take something for it.",
  "I’m afraid of negative numbers. I’ll stop at nothing to avoid them.",
  "Acupuncture is a jab well done.",
  "Two antennas got married. The ceremony wasn’t much, but the reception was excellent.",
  "I quit my job at the donut factory. I was fed up with the hole business.",
  "I once ate a watch. It was time consuming.",
  "RIP boiling water. You will be mist.",
  "Why did the monk refuse novocaine when he had his tooth pulled? He wanted to transcend dental medication.",
  "Just found out sticks float. They would.",
  "My boat was cold, I tried to make a fire but it sank. I guess you can’t have your kayak and heat it too.",
  "I went to that new restaurant, Karma. There’s no menu, you just get what you deserve.",
  "Why do cows have bells? Because their horns don’t work.",
  "You can’t trust atoms, they make up everything.",
  "I met a criminal with a bounty on his head. That was a weird place to keep paper towels.",
  "A psychic tried to sell me information on my past lives. I hate used karma dealers.",
  "I’m reading a book about anti-gravity. It’s impossible to put down.",
  "I met my wife on a dating site. We just clicked.",
  "I did a theatrical performance about puns. It was a play on words.",
  "Thanks for explaining the word “many” to me. It means a lot.",
  "My roommates suspect I’m stealing their kitchen utensils. But that’s a whisk i’m willing to take.",
  "I’m going to try velcro instead of shoe laces. Why knot?",
  "I decided to get rid of my spine. It was holding me back.",
  "Long fairy tales have a tendency to dragon.",
  "Knowing how to pick locks has opened a lot of doors for me.",
  "No matter how kind you are, German children are kinder.",
  "Architects are good at coming up with concrete plans.",
  "I should have been sad when my flashlight batteries died, but I was delighted.",
  "Who designed King Arthur’s round table? Sir Cumference.",
  "What happened when the semi-colon broke grammar laws? He was given two consecutive sentences.",
  "I recently took a pole and found out 100% of campers were angry when their tent collapsed.",
  "I couldn’t remember how to throw a boomerang. Eventually it came back to me.",
  "A friend said he didn’t understand cloning. I told him that makes two of us.",
  "I had a pun about amnesia, but I forget how it goes.",
  "Santa Claus’s elves are subordinate clauses.",
  "I’m designing a reversible jacket. I’m excited to see how it turns out.",
  "A man went to the hospital with eight plastic horses in his stomach. His condition is stable.",
  "To the guy who invented Zero, thanks for nothing!",
  "There’s a new type of broom out. It’s sweeping the nation.",
  "I tried to draw a circle, but it was pointless.",
  "Getting paid to sleep would be my dream job.",
  "There’s a fine line between numerator and denominator.",
  "Velcro… what a rip-off.",
  "I gave away my dead batteries, no charge.",
  "One-fifth of people are just too tense.",
  "After the birth of your child, your role in life will become apparent.",
  "A backwards poet writes inverse.",
  "Bakers trade bread recipes on a knead to know basis.",
  "My kid swallowed some coins, the doctor told me to just wait. No change yet.",
  "My friend’s bakery burned down. Now his business is toast.",
  "You should wear glasses while doing math. It improves division.",
  "I’m glad I learned sign language. It’s really handy.",
  "Bad gardeners are rough around the hedges.",
  "A boiled egg in the morning is hard to beat.",
  "This girl thought she recognized me from vegetarian club, but I’ve never met herbivore.",
  "Why can’t you explain puns to kleptomaniacs? They always take things literally.",
  "Did you hear about the man who lost his left side? He’s all right now.",
  "I make apocalypse puns like there’s no tomorrow.",
  "A cartoonist was found dead. Details are sketchy.",
  "I removed the shell from my racing snail to make it faster. It just got more sluggish.",
  "Life as a professional yo-yoer has its ups and downs.",
  "I don’t trust stairs. They’re always up to something.",
  "My wife told me to stop speaking in numbers. But I didn’t 1 2.",
  "I failed my Braille class. It’s a touchy subject.",
  "I used to hate facial hair, but it grew on me.",
  "The shovel was a ground-breaking invention.",
  "My leaf blower doesn’t work, it just sucks.",
  "Need an ark? I Noah guy.",
  "A plateau is the highest form of flattery.",
  "A man sued an airline company after they couldn’t find his luggage. He lost his case.",
  "Why couldn’t the sesame seed leave the poker table? He was on a roll.",
  "Did you hear about the man who tried to catch fog? He mist.",
  "I wrote a song about a tortilla. Well, it’s actually more of a wrap.",
  "Why did the can crusher quit his job? It was soda pressing.",
  "Last week I called someone a watering hole, but I meant well.",
  "Yeah, I steal brake fluid. But I can stop anytime.",
  "The definition of a will? It’s a dead giveaway.",
  "I wondered why the baseball was getting bigger. Then it hit me.",
  "I used to be addicted to soap, but I’m clean now.",
  "How much money does a pirate pay for corn? A buccaneer.",
  "What lies at the bottom of the ocean and twitches? A nervous wreck.",
  "Don’t interrupt someone working on a puzzle. You’ll hear some crosswords.",
  "Why was King Arthur’s army too tired to fight? It had too many sleepless knights.",
  "All these sea monster jokes are Kraken me up.",
  "What do you call a bee that can’t make up its mind? A maybe.",
  "What do you call a pig that does karate? Pork chop.",
  "What do you get when two dinosaurs crash their cars? A T-Wrecks.",
  "What job did the frog have at the hotel? Bellhop.",
  "What do you call an everyday potato? A commentator.",
  "How do you put a baby alien to sleep? You rocket.",
  "What do you call a lazy kangaroo? A pouch potato.",
  "What did the volcano say to his wife? I lava you.",
  "What do you call and owl that does magic? Hoodini.",
  "Why did the banana go to the doctor? It wasn’t peeling well.",
  "What do you call a classy salmon? Sofishticated.",
  "What do you call a bear with no teeth? Gummybear.",
  "How do you organize a space party? You planet.",
  "What do you call and alligator in a vest? An investigator.",
  "What sound does a sleeping T-Rex make? A dino-snore.",
  "Want to hear a joke about paper? Never mind, it’s tearable.",
  "I dreamed I was swimming in an ocean of orange soda. But it was just a Fanta sea.",
  "I got fired as train engineer. They tallied up all my accidents, it was so hard to keep track.",
  "Accidentally buried someone alive. It was a grave mistake.",
  "I had to clean out all my spices. What a waste of thyme.",
  "What do you call a laughing motorcycle? Yamahahaha.",
  "A friend of mine annoyed me with bird puns. But toucan play at that game.",
  "A termite walks into a bar and says, “Where is the bar tender?”",
  "I told my friend I was going to make a bike out of spaghetti. You should have seen her face when I rode straight pasta.",
  "What’s the worst part about movie theater candy prices? They’re always raisinet.",
  "Why is peter pan always flying? He neverlands.",
  "What did the librarian say when the books were a mess? We ought to be ashamed of ourshelves.",
  "Why did the police go to a daycare center? A 3-year-old was resisting a rest.",
  "Why did the tomato blush? Because it saw the salad dressing.",
  "Did you hear the rumor about peanut butter? I’m not telling you. You might spread it.",
  "What do you call cheese that isn’t yours? Nacho cheese.",
  "Why couldn’t the sesame seed leave the poker table? A: He was on a roll.",
  "I sent ten puns into a contest hoping one would win. No pun in ten did.",
  "How much room should you give fungi to grow? As mushroom as possible.",
  "I cut my finger shredding cheese, but I think I may have grater problems.",
  "How do trees get online? They just log in.",
  "Why are dogs bad storytellers? Because they only have one tale.",
  "Why shouldn’t you tell a secret on a farm? Because the potatoes have eyes and the corn has ears.",
  "Why do hamburgers go to the gym? To get better buns.",
  "What do you do when life gives you melons? See a doctor, you’re probably dyslexic.",
  "It was a terrible summer for Humpty Dumpty. But he had a great fall.",
  "A Chinese restaurant got vandalized. It was an act of wonton destruction.",
  "What do you call a dishonest noodle? An Impasta.",
  "What do you get from a pampered cow? Spoiled milk.",
  "Where are average products made? The satisfactory.",
  "Mummifying puns are so disheartening.",
  "Why does a chicken coop have two doors? If it had four, it would be a chicken sedan.",
  "Why shouldn’t you mention the number 288? It’s two gross.",
  "Why did the mathematician’s numeral keep ending up in the wrong place? It was Roman.",
  "What do you call a parade of rabbits hopping backwards? A receding hare-line.",
  "How do you get down from an elephant? You don’t. You get down from a goose.",
  "Why should you never breakup with a goalie? Because he’s a keeper.",
  "Why are frogs so happy? They eat whatever bugs them.",
  "How do you keep a bagel from getting away? Put lox on it.",
  "A criminal’s best asset is his lie ability.",
  "Which is faster, heat or cold? Heat, you can catch cold.",
  "I gave a valuable comb to a bald friend. He’ll never part with it.",
  "Why couldn’t the circus replace their human cannonball? They couldn’t find another man of his caliber.",
  "Why do bicycles fall over? Because they’re two-tired.",
  "What did the ill comic say in the hospital? I’m here … all weak.",
  "I named my dogs Rolex and Timex. They’re watchdogs.",
  "Advanced math is easy as pi.",
  "Why does coffee hate mornings? It keeps getting mugged.",
  "A jumper cable walks into a bar. The bartender says, “I’ll serve you, but don’t start anything.”",
  "What did the grape say when he got stepped on? Nothing, he just let out a little whine.",
  "Life as an elevator repairman has its ups and downs.",
  "Learning to sleep upside down is hard for bats, but they get the hang of it.",
  "Waking up is an eye-opening experience.",
  "I used to be a banker, until I lost interest.",
  "Why couldn’t the coffee go out? It was grounded.",
  "No matter how hard you push the envelope, it will still be stationery.",
  "When I get undressed in the bathroom, the shower usually gets turned on.",
  "Why are teddy bears never hungry? They’re always stuffed.",
  "I used to be a shoe salesman, until they gave me the boot.",
  "It was an emotional wedding. Even the cake was in tiers.",
  "Will glass coffins be a success? Remains to be seen.",
  "I knew a mathematician who couldn’t afford lunch. He could binomial.",
  "Where do robots go for fun? The circuits.",
  "I accidentally ate food coloring. I feel like I’ve dyed a little inside.",
  "Show me a piano falling down a mineshaft and I’ll show you A-flat minor.",
  "To solve claustrophobia you have to think outside the box.",
  "What did the mermaid wear to math class? An algae-bra.",
  "Only small babies are delivered by stork, the big ones need a crane.",
  "If you ever feel cold just stand in a corner. They’re usually around 90 degrees.",
  "I just heard they won’t be making rulers any longer.",
  "By shear coincidence, all these sheep look the same."
]